# Selecting Rows in Pandas DataFrames

Oftentimew you want to just select certain rows and columns from DataFrames ("subsetting" or "filtering"). In this notebook, we will learn how to select rows and columns from a Pandas DataFrame using:

- `.loc` → label-based selection  
- `.iloc` → integer-position-based selection  

These tools are essential for exploring, filtering, and analyzing data.

## Setup

In [1]:
import pandas as pd

## Example DataFrame

In [2]:
df = pd.DataFrame({
    "name": ["Alice", "Bob", "Charlie", "Diana"],
    "age": [23, 30, 35, 28],
    "score": [88, 92, 79, 95]
}, index=["a", "b", "c", "d"])

df

      name  age  score
a    Alice   23     88
b      Bob   30     92
c  Charlie   35     79
d    Diana   28     95

## `.loc` vs `.iloc`

| Method | Selection Type | Uses |
|------|----------------|------|
| `.loc` | Label-based | Row/column **names** |
| `.iloc` | Position-based | Integer **positions** of rows or columns|

Both follow the same general syntax:

```python
df.loc[rows, columns]
df.iloc[rows, columns]
```

## Selecting Rows with `.loc`

To select rows using their **index labels**, use `.loc`. Though the standard syntax is `.loc[rows, columns]`, note that if just one item is supplied to `.loc`, it will be treated as index labels. This is in contrast to slicing without `.loc`, where one item supplied is assumed to be the name/s of columns.

In [5]:
df

      name  age  score
a    Alice   23     88
b      Bob   30     92
c  Charlie   35     79
d    Diana   28     95

In [3]:
df.loc["a"]

name     Alice
age         23
score       88
Name: a, dtype: object

In [4]:
# As a reminder of former material: selecting DataFrame columns
df["score"]

a    88
b    92
c    79
d    95
Name: score, dtype: int64

### Selecting Multiple Rows using loc

In [6]:
df.loc[["a", "c"]]

      name  age  score
a    Alice   23     88
c  Charlie   35     79

## Selecting Rows with `.iloc`

Sometimes you don't remember or care to remember any special index names! `.iloc` selects rows based on their **integer position**, starting from 0.

In [7]:
df.iloc[0]

name     Alice
age         23
score       88
Name: a, dtype: object

### Selecting Multiple Rows with .iloc

In [ ]:
df.iloc[[0, 2]]

## Row Slicing

Just like NumPy slicing, `.iloc` supports slicing. `.loc` also supports slicing.

In [8]:
df.iloc[1:3]

      name  age  score
b      Bob   30     92
c  Charlie   35     79

Note: When using .loc slicing includes the endpoint when using labels.

In [ ]:
df.loc["b":"d"]

## Selecting Rows and Columns Together

The full syntax is:

```python
df.loc[rows, columns]
```

Selecting a Single Cell

In [9]:
df.loc["a", "score"]

88

### Selecting an Entire Column (as a Series)
You can also use `.loc` to select columns, though it's a bit more typing than simply using `df[column_name]`.

In [ ]:
df.loc[:, ["age"]]

### Selecting Multiple Columns (as a DataFrame)

In [ ]:
df.loc[:, ["age", "score"]]

## Using `.iloc` for Rows and Columns

In [10]:
df.iloc[:, 1]

a    23
b    30
c    35
d    28
Name: age, dtype: int64

In [11]:
df.iloc[:, [1, 2]]

   age  score
a   23     88
b   30     92
c   35     79
d   28     95

## Practice Exercises

1. Select the row for `"Charlie"` using `.loc`.
2. Select the second row using `.iloc`.
3. Select the `"age"` column as a Series.
4. Select both `"age"` and `"score"` columns as a DataFrame.
5. Select the cell corresponding to `"Diana"` and `"score"`.

---

In [12]:
df

      name  age  score
a    Alice   23     88
b      Bob   30     92
c  Charlie   35     79
d    Diana   28     95

In [19]:
#Answer_1
output_1 =  df.loc["c"]
print(output_1)

#Answer_2
output_2 =  df.iloc[1]
print(output_2)

#Answer_3
output_3 =  df.loc[:, ["age"]]
print(output_3)

name     Charlie
age           35
score         79
Name: c, dtype: object
name     Bob
age       30
score     92
Name: b, dtype: object
   age
a   23
b   30
c   35
d   28

In [ ]:




#Answer_4
output_4 =  #Your code goes here
print(output_4)

#Answer_5
output_5 =  #Your code goes here
print(output_5)

SyntaxError: invalid syntax (3681952408.py, line 6)